public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}

/*

  Student: хранит информацию о студенте (имя и фамилия, возраст, группа).
  Course: описывает курс, включающий темы и задания с возможными максимальными баллами.
  Topic: представляет отдельную тему курса (например, "Ветвления", "Циклы").
  Task: описывает задание с полями для типа задания (упражнение, домашнее задание, семинар), а также возможные баллы и сложность.
  Performance: хранит данные о результатах выполнения заданий, связывая студента, задание и оценку.
  Analysis (интерфейс): определяет методы для расчета статистики успеваемости по возрасту, такие как средний балл для определенной возрастной группы.

 */